SE4Foam/tutorials/valids/turbulent/fr_Petukhov/Re1e5_kEpsilon/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.73e-3;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2.73e-3;//k = 1.5*(U*I)^2, I=0.05 or 0.16*Re^(-1/8)
    }
    outlet
    {
        type            zeroGradient;
    }
    tubeWall
    {
        type            kqRWallFunction;
        value           uniform 2.73e-3;
    }
}


// ************************************************************************* //
